[
  {
    "Id": "630580",
    "ThreadId": "262180",
    "Html": "\r\n<p>Hi everyone,</p>\r\n<p>Jelle has been kind enough to add me as a&nbsp;contributor&nbsp;to this great project. Once I get situated with the CodePlex source control system, I will merge my fixes for vs2010 into the current version of the project, test my changes, then submit them\r\n as a patch to this site. Though I'm pretty busy at the moment, I hope to have this done by end of week.</p>\r\n<p>Thanks again to Jelle and the other developers of this project. I use this project heavily at work for our complex configuration setups and it is MUCH easier than doing the work by hand.</p>\r\n<p>&nbsp;</p>\r\n<p>Regards,</p>\r\n<p>Andrew</p>\r\n",
    "PostedDate": "2011-06-21T07:09:32.39-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "632330",
    "ThreadId": "262180",
    "Html": "<p>Hey Andrew.</p>\r\n<p>I looked through your latest changes, and I love what I'm seeing. You clearly know what you are doing, and your contributions will no doubt make this project better.</p>\r\n<p>I do have one concern, though, which I figure I should voice before it could become too late. At least for the very first official 2010 release, I think the two tools should create compatible data. Mostly so that people who still uses the 2008 version of the tool can just upgrade their projects to 2010 and keep using their existing configuration section designs. I'm voicing this concern because I noticed you had made changes to the DslDefinition.dsl file, and if not done carefully, it can break compatibility.</p>\r\n<p>Not having actually tested your code, I can't say if the changes you made actually matter, but yeah... it's just a general concern more than a specific one.</p>\r\n<p>Anyway, welcome to the team! I haven't been active on this project for a long time, mostly for the same reason as all the other developers -- I've got other things to do, and my initial interest of improving CSD has waned a bit. The company I work for is really wanting a working, official VS2010 version of this tool, though, so I hope you get to that point. :-)</p>\r\n<p>Alex</p>",
    "PostedDate": "2011-06-24T00:39:26.003-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "632481",
    "ThreadId": "262180",
    "Html": "<p>Backward compatibility is a very valid concern. I tried to make the changes in a way that extra features will simply be gracefully ignored if moved to an older version. I will make sure to keep compatibilty a high priority and will continue to perform tests moving CSD's back and forth between versions.</p>\r\n<p>I'm with you on the Visual Studio 2010 version with your company bit. The whole reason why I did the work on this project was because my company also wanted to use this project on Visual Studio 2010 projects. I've been using my updated version for weeks now with no major issues.</p>\r\n<p>&nbsp;</p>\r\n<p>-Andrew</p>",
    "PostedDate": "2011-06-24T06:00:52.597-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "632485",
    "ThreadId": "262180",
    "Html": "<p>For other readers:</p>\n<p>Latest fixes have been posted (VS2010 right-click error and \"cannot find project item\" error). Also, new feature added to allow adding comment boxes to your diagrams (The part Alex and I were just discussing). Please note that these changes only apply to  Version 2 (for Visual Studio 2010). I need to install the older version of DSL before I can apply changes t the 1.x versions.</p>\n<p>Find the Visual Studio 2010 VSIX here:</p>\n<p><a href=\"http://csd.codeplex.com/workitem/6922\">http://csd.codeplex.com/workitem/6922</a></p>",
    "PostedDate": "2011-06-24T06:05:59.01-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]