{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Text Templates",
      "DisplayName": "Text Templates"
    },
    "ClosedComment": "This issue has been resolved with change set 31948 using a Custom Tool that only targets CSD files instead of using generic Text Transformer files and the &#34;Transform All Templates&#34; command.",
    "ClosedDate": "2009-12-09T10:05:21.527-08:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "Hi,\n \nThis is a small issue that creates some confusion when working with source control.\n \nWe have several projects in one solution ,3 CSD projects, a couple libraries and a web application that has a lot of resource files.\n \nWhen I save the diagram, I can see in the Output for Transform text templates that it is not just the current CSD project that gets transformed;  All three CSD projects get re-transformed.\nIt seems like everything in the solution that has a \"Custom Tool\" specified get processed.\n \nThis becomes a problem because all of the code files generated by the various custom tools get checked from source control. \nWhen the time comes to check in, we have a large number of files to check in that are not files that you have not consciously changed.\n \nThis isn't a show-stopper, but if its possible to fix it would be nice.\n \nThanks",
    "LastUpdatedDate": "2013-05-16T04:04:55.89-07:00",
    "PlannedForRelease": "1.2",
    "ReleaseVisibleToPublic": true,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "csd",
    "ReportedDate": "2008-09-19T08:32:49.027-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "Resx and dbml files in solution are also transformed when saving diagram",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 3005
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "Indeed, I can imagine that having all these files checked out any time you save a diagram isn't ideal. I don't know of a mechanism to transform only the current text template, which is why I simply tell Visual Studio to transform them all (and apparently that takes others like resx and dbml files with it too).\r\n\r\nWhat you can do, however, is select the CSD designer surface itself and in the properties window change \"Auto Transform Templates\" to false. This will stop the automatic transformations on a save, but then you will of course need to run the custom tool manually if you make a change to a CSD file. ",
      "PostedDate": "2008-09-19T11:14:37.7-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2008-09-19T11:16:03.76-07:00",
      "Id": -2147483648
    },
    {
      "Message": "This is caused by Visual Studio behavior which cannot be modified, a workaround is to disable \"Auto Transform Templates\" on the CSD diagram.\n\n** Closed by jelled 9/19/2008 11:16 AM",
      "PostedDate": "2009-12-09T10:03:29.13-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Issue has since been fixed, and needs an update.",
      "PostedDate": "2009-12-09T10:03:30.11-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-12-09T10:04:17.427-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-12-09T10:05:21.527-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T16:30:38.3-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T04:04:55.89-07:00",
      "Id": -2147483648
    }
  ]
}